Autodesk.Revit.DB.ConnectorJointType
Connector joint type enum
Enum of connector joint type

Autodesk.Revit.DB.ConnectorJointType.Soldered
Soldered connector joint type

Autodesk.Revit.DB.ConnectorJointType.Glued
Glued connector joint type

Autodesk.Revit.DB.ConnectorJointType.Grooved
Grooved connector joint type

Autodesk.Revit.DB.ConnectorJointType.Threaded
Threaded connector joint type

Autodesk.Revit.DB.ConnectorJointType.Welded
Welded connector joint type

Autodesk.Revit.DB.ConnectorJointType.Flanged
Flanged connector joint type

Autodesk.Revit.DB.ConnectorJointType.Undefined
Undefined connector joint type